In [23]:
import pandas as pd
import statsapi
from pprint import pprint
import json

# TODO: https://towardsdatascience.com/how-to-convert-json-into-a-pandas-dataframe-100b2ae1e0d8
# TODO: json_normalize, json_read
# TODO: glom pypi

In [24]:
# BASIC JSON TO PANDAS

# Make json-formatted string:
json_string = '{ "name":"John", "age":30, "car":"None" }'
your_json = json.loads(json_string)
print(your_json)

{'name': 'John', 'age': 30, 'car': 'None'}

In [25]:
# SIMPLE JSON FROM FILE - LIST OF UNIFORM DICTS
df = pd.read_json('./simple_json.json')

df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         3 non-null      object
 1   name       3 non-null      object
 2   math       3 non-null      int64
 3   physics    3 non-null      int64
 4   chemistry  3 non-null      int64
dtypes: int64(3), object(2)
memory usage: 248.0+ bytes

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51
2  A003  Jenny    79       90         78

In [26]:
# Simple JSON from URL
URL = 'http://raw.githubusercontent.com/BindiChen/machine-learning/master/data-analysis/027-pandas-convert-json/data/simple.json'

df = pd.read_json(URL)
df

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51
2  A003  Jenny    79       90         78

In [27]:
# Flattenend Nest List from JSON


# load data using Python JSON module
with open('./nested_json.json','r') as f:
    data = json.loads(f.read())             # Flatten data

df_nested_list = pd.json_normalize(data, record_path =['students'])
df_nested_list

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51
2  A003  Jenny    79       90         78

In [28]:
# To include school_name and class
df_nested_list = pd.json_normalize(
    data, 
    record_path =['students'], 
    meta=['school_name', 'class']
)

df_nested_list

     id   name  math  physics  chemistry         school_name   class
0  A001    Tom    60       66         61  ABC primary school  Year 1
1  A002  James    89       76         51  ABC primary school  Year 1
2  A003  Jenny    79       90         78  ABC primary school  Year 1

---------

In [18]:
# NESTED LIST IN DICT JSON

# load data using Python JSON module
with open('nested_list_dict.json','r') as f:
    data = json.loads(f.read())
    
# Normalizing data
df = pd.json_normalize(data, record_path =['students'])

df

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51
2  A003  Jenny    79       90         78

In [19]:
# And to include class, president (a property of info), and tel (a property of contacts.info), 
# use the argument meta to specify the path to the property.

df = pd.json_normalize(
# To include
    
    data, 
    record_path =['students'], 
    meta=[
        'class',
        ['info', 'president'], 
        ['info', 'contacts', 'tel']
    ]
)

df

,id,name,math,physics,chemistry,class,info.president,info.contacts.tel
0,A001,Tom,60,66,61,Year 1,John Kasich,123456789
1,A002,James,89,76,51,Year 1,John Kasich,123456789
2,A003,Jenny,79,90,78,Year 1,John Kasich,123456789

In [22]:
# Extract single value from deeply nested JSON
from glom import glom
df = pd.read_json('nested_extract.json')
df['students'].apply(lambda row: glom(row, 'grade.math'))

ModuleNotFoundError: No module named 'glom'

In [21]:
# DICT TO JSON TO PANDAS
# TODO: finish dict_to_pandas

dict_1 = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}

#DICT TO JSON

dict_json = json.dumps(dict_1)    #dict_json - str type
pprint(dict_json)
print(f"type of dict_json: {type(dict_json)}")
# JSON TO PANDAS
# TODO: https://www.statology.org/valueerror-if-using-all-scalar-values-you-must-pass-an-index/
jsonData = json.loads(dict_json)    # jsonData - dict type
print(jsonData)
print(type(jsonData))
df=pd.DataFrame.from_dict([jsonData])  # MUST WRAP DICT IN LIST

df

# Make json-formatted string:
# json_string = '{ "name":"John", "age":30, "car":"None" }'
# your_json = json.loads(json_string)
# print(your_json)
# df=(jsonData)


# TODO: [pandas.DataFrame.from_dict](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.from_dict.html)

'{"a": 1, "b": 2, "c": 3, "d": 4, "e": 5}'
type of dict_json: <class 'str'>
{'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}
<class 'dict'>

   a  b  c  d  e
0  1  2  3  4  5